[
  {
    "id": 1,
    "scenario": "You receive an email claiming you've won $1 million in a lottery you never entered. They ask for your bank details to transfer the money.",
    "isScam": true,
    "explanation": "This is a classic lottery scam. Legitimate lotteries don't require upfront fees or personal banking information via email."
  },
  {
    "id": 2,
    "scenario": "A company's official website shows their quarterly earnings report with verified financial data and SEC filings.",
    "isScam": false,
    "explanation": "Official company websites with SEC filings and verified financial data are legitimate sources of investment information."
  },
  {
    "id": 3,
    "scenario": "Someone on social media promises 500% returns in 30 days with a 'secret trading strategy' for just $99.",
    "isScam": true,
    "explanation": "Promises of guaranteed high returns with 'secret strategies' are classic investment scams. Legitimate investments carry risk."
  },
  {
    "id": 4,
    "scenario": "Your bank sends you a text with a link asking you to verify your account due to 'suspicious activity'.",
    "isScam": true,
    "explanation": "Banks don't ask for account verification via text links. This is phishing. Always contact your bank directly."
  },
  {
    "id": 5,
    "scenario": "A licensed financial advisor discusses diversified portfolio options and mentions both risks and potential returns.",
    "isScam": false,
    "explanation": "Licensed advisors who discuss both risks and returns, and promote diversification, are following legitimate practices."
  },
  {
    "id": 6,
    "scenario": "An investment opportunity requires you to recruit friends to make money, with bigger rewards for more recruits.",
    "isScam": true,
    "explanation": "This describes a pyramid scheme. Legitimate investments make money from actual business activities, not recruitment."
  },
  {
    "id": 7,
    "scenario": "A cryptocurrency exchange requires KYC verification and is regulated by financial authorities.",
    "isScam": false,
    "explanation": "Regulated exchanges with KYC (Know Your Customer) requirements are legitimate and follow legal compliance standards."
  },
  {
    "id": 8,
    "scenario": "You get a call saying you owe back taxes and must pay immediately with gift cards to avoid arrest.",
    "isScam": true,
    "explanation": "Government agencies don't demand immediate payment with gift cards or threaten arrest over the phone."
  },
  {
    "id": 9,
    "scenario": "A mutual fund company provides detailed prospectus documents outlining fees, risks, and historical performance.",
    "isScam": false,
    "explanation": "Legitimate investment companies are required to provide detailed prospectus documents with transparent information."
  },
  {
    "id": 10,
    "scenario": "An online broker offers 'guaranteed profits' and asks you to deposit money into a personal account, not a regulated brokerage account.",
    "isScam": true,
    "explanation": "No legitimate investment offers guaranteed profits. Funds should go to regulated brokerage accounts, not personal accounts."
  },
  {
    "id": 11,
    "scenario": "A financial news website publishes market analysis with author credentials and cites reliable sources.",
    "isScam": false,
    "explanation": "Credible financial news with author credentials and reliable sources provides legitimate market information."
  },
  {
    "id": 12,
    "scenario": "Someone claims to be a 'crypto guru' and asks for your private wallet keys to 'optimize' your investments.",
    "isScam": true,
    "explanation": "Never share private wallet keys. Legitimate services never need your private keys to provide advice."
  },
  {
    "id": 13,
    "scenario": "A robo-advisor platform is SEC-registered and clearly explains their algorithm-based investment strategy.",
    "isScam": false,
    "explanation": "SEC-registered robo-advisors with transparent strategies are legitimate automated investment services."
  },
  {
    "id": 14,
    "scenario": "You receive an urgent email about a 'limited time' investment opportunity that will 'expire in 24 hours'.",
    "isScam": true,
    "explanation": "High-pressure tactics with artificial urgency are red flags. Legitimate investments don't use such pressure tactics."
  },
  {
    "id": 15,
    "scenario": "A company's stock is listed on major exchanges like NYSE or NASDAQ with public trading data.",
    "isScam": false,
    "explanation": "Stocks listed on major regulated exchanges undergo scrutiny and provide transparent public trading information."
  }
]