[
  {
    "id": 1,
    "scenario": "You just made a 15% profit on a stock trade in one day. You're feeling confident and considering doubling your position size for the next trade.",
    "options": [
      "Double the position size to maximize gains",
      "Stick to your original position sizing strategy",
      "Take a break and analyze what made this trade successful"
    ],
    "correct": 2,
    "explanation": "Taking time to analyze successful trades helps you understand what worked and avoid overconfidence bias. Doubling position size after one win can lead to dangerous risk-taking.",
    "category": "Overconfidence"
  },
  {
    "id": 2,
    "scenario": "Your portfolio is down 8% this month, and you're feeling anxious about every market movement. You find yourself checking prices every few minutes.",
    "options": [
      "Check prices more frequently to stay informed",
      "Set specific times to review your portfolio (e.g., once daily)",
      "Sell everything to stop the emotional stress"
    ],
    "correct": 1,
    "explanation": "Setting specific review times helps reduce anxiety and prevents emotional decision-making. Constant monitoring often leads to impulsive actions based on short-term fluctuations.",
    "category": "Anxiety Management"
  },
  {
    "id": 3,
    "scenario": "You bought a stock at $50, and it's now at $45. The company just announced positive earnings, but the stock continues to drop due to market sentiment.",
    "options": [
      "Sell immediately to cut losses",
      "Buy more shares since the fundamentals are strong",
      "Review your original thesis and risk management plan"
    ],
    "correct": 2,
    "explanation": "Always return to your original analysis and risk management plan. This helps you make rational decisions based on facts rather than emotions or market noise.",
    "category": "Loss Management"
  },
  {
    "id": 4,
    "scenario": "You missed out on a stock that gained 25% after you decided not to buy it. Now you're considering chasing it at the higher price.",
    "options": [
      "Buy it now before it goes higher",
      "Wait for a pullback to your original target price",
      "Move on and focus on other opportunities"
    ],
    "correct": 2,
    "explanation": "FOMO (Fear of Missing Out) can lead to poor decisions. There are always new opportunities in the market. Chasing stocks often results in buying at peaks.",
    "category": "FOMO"
  },
  {
    "id": 5,
    "scenario": "You've had three losing trades in a row, each following your trading plan perfectly. You're starting to doubt your strategy.",
    "options": [
      "Abandon the strategy and try something new",
      "Increase position sizes to recover losses faster",
      "Continue following the plan and review performance over a longer timeframe"
    ],
    "correct": 2,
    "explanation": "Three trades is too small a sample size to judge a strategy. Good trading plans account for losing streaks. Consistency and long-term thinking are key to success.",
    "category": "Discipline"
  },
  {
    "id": 6,
    "scenario": "The market is extremely volatile today, with your stocks swinging 5-10% in both directions. You feel the urge to make quick trades to capitalize.",
    "options": [
      "Make quick trades to profit from the volatility",
      "Stick to your planned trades and ignore the noise",
      "Close all positions until the market calms down"
    ],
    "correct": 1,
    "explanation": "Volatile markets can create opportunities, but they also increase the risk of emotional trading. Sticking to your plan helps avoid impulsive decisions driven by market chaos.",
    "category": "Market Volatility"
  },
  {
    "id": 7,
    "scenario": "You're holding a winning position that's up 30%, but you're worried it might reverse. Your original target was 40% gain.",
    "options": [
      "Sell now to lock in the 30% profit",
      "Hold until your original 40% target",
      "Sell half and let the rest run to your target"
    ],
    "correct": 2,
    "explanation": "Taking partial profits allows you to secure some gains while still participating in potential upside. This balanced approach helps manage both greed and fear.",
    "category": "Profit Taking"
  },
  {
    "id": 8,
    "scenario": "You just read a news article about a potential market crash. Your portfolio is currently profitable, but you're feeling uncertain.",
    "options": [
      "Sell everything immediately to protect profits",
      "Ignore the news and stick to your investment plan",
      "Review your risk management and adjust position sizes if needed"
    ],
    "correct": 2,
    "explanation": "News can create emotional reactions. The best approach is to assess how new information affects your risk management rather than making knee-jerk reactions.",
    "category": "News Reaction"
  },
  {
    "id": 9,
    "scenario": "You've been researching a stock for weeks and finally bought it. The next day, it drops 5% on no significant news.",
    "options": [
      "Sell immediately - the market knows something you don't",
      "Buy more shares at the lower price",
      "Do nothing and stick to your original plan"
    ],
    "correct": 2,
    "explanation": "Short-term price movements without fundamental changes shouldn't alter your long-term thesis. Patience and conviction in your research are important trading qualities.",
    "category": "Patience"
  },
  {
    "id": 10,
    "scenario": "Your friend just made 50% on a cryptocurrency trade and keeps talking about it. You don't understand crypto but feel like you're missing out.",
    "options": [
      "Invest in the same cryptocurrency immediately",
      "Research cryptocurrencies thoroughly before investing",
      "Stick to investments you understand"
    ],
    "correct": 2,
    "explanation": "Never invest in something you don't understand just because others are making money. Stick to your circle of competence and avoid FOMO-driven decisions.",
    "category": "Social Pressure"
  },
  {
    "id": 11,
    "scenario": "You set a stop-loss at 10% below your purchase price. The stock hits your stop-loss during a market dip but recovers the same day.",
    "options": [
      "Feel frustrated and abandon stop-losses",
      "Buy back the stock immediately",
      "Accept that stop-losses sometimes result in whipsaws but are still important"
    ],
    "correct": 2,
    "explanation": "Stop-losses are risk management tools that sometimes result in whipsaws. This is the cost of protection. Abandoning risk management after one bad experience is dangerous.",
    "category": "Risk Management"
  },
  {
    "id": 12,
    "scenario": "You're up significantly on a trade, but the stock keeps going higher. You're torn between taking profits and letting it run further.",
    "options": [
      "Hold everything and let it run",
      "Sell everything and take profits",
      "Use a trailing stop to protect gains while allowing for upside"
    ],
    "correct": 2,
    "explanation": "Trailing stops help balance the desire to capture more gains with the need to protect profits. They automatically adjust as the stock moves in your favor.",
    "category": "Profit Protection"
  },
  {
    "id": 13,
    "scenario": "You've been day trading for a month and are down 15%. You believe you just need to trade more to make back the losses.",
    "options": [
      "Increase trading frequency to recover losses faster",
      "Take a break and evaluate what went wrong",
      "Switch to a completely different trading style"
    ],
    "correct": 1,
    "explanation": "When losing, the best approach is to step back and analyze what's not working. Increasing activity often leads to more losses due to emotional decision-making.",
    "category": "Loss Recovery"
  },
  {
    "id": 14,
    "scenario": "The market has been trending upward for months, and almost every stock you pick seems to go up. You're feeling like you can't lose.",
    "options": [
      "Increase position sizes since you're on a hot streak",
      "Maintain your risk management discipline",
      "Start trading more speculative stocks"
    ],
    "correct": 1,
    "explanation": "Bull markets can create false confidence. Maintaining discipline during good times prepares you for inevitable market downturns and prevents overconfidence.",
    "category": "Bull Market Psychology"
  },
  {
    "id": 15,
    "scenario": "You bought a stock based on a tip from a colleague. It's down 20%, and you realize you don't understand the company's business model.",
    "options": [
      "Hold and hope it recovers",
      "Sell and take the lesson about doing your own research",
      "Buy more to average down the cost"
    ],
    "correct": 1,
    "explanation": "When you realize you don't understand an investment, it's better to exit and learn from the mistake. Averaging down on something you don't understand compounds the error.",
    "category": "Research Discipline"
  },
  {
    "id": 16,
    "scenario": "You're watching your portfolio during market hours and notice one of your stocks is down 3% while the market is up 1%.",
    "options": [
      "Sell the underperforming stock immediately",
      "Research if there's specific news about the company",
      "Ignore the daily fluctuation"
    ],
    "correct": 2,
    "explanation": "Before reacting to price movements, always check if there's specific news or if it's just normal market fluctuation. One day's performance rarely changes the long-term thesis.",
    "category": "Information Processing"
  },
  {
    "id": 17,
    "scenario": "You've made several successful trades using technical analysis, but your last three trades based on the same patterns have failed.",
    "options": [
      "Abandon technical analysis completely",
      "Review if market conditions have changed",
      "Increase position sizes to make up for recent losses"
    ],
    "correct": 1,
    "explanation": "Market conditions change, and what works in one environment may not work in another. Regularly reviewing and adapting your approach is crucial for long-term success.",
    "category": "Strategy Adaptation"
  },
  {
    "id": 18,
    "scenario": "You're considering a large position in a stock that could make or break your portfolio performance for the year.",
    "options": [
      "Take the large position for maximum impact",
      "Size the position according to your risk management rules",
      "Skip the trade entirely to avoid the risk"
    ],
    "correct": 1,
    "explanation": "Never let one trade determine your entire portfolio's fate. Proper position sizing ensures that no single trade can cause catastrophic losses, even if it's a great opportunity.",
    "category": "Position Sizing"
  },
  {
    "id": 19,
    "scenario": "After a string of losses, you finally have a winning trade. You're tempted to sell quickly to 'lock in' the win and feel good again.",
    "options": [
      "Sell immediately to secure the psychological win",
      "Let the trade run according to your original plan",
      "Sell half to feel better and let half run"
    ],
    "correct": 1,
    "explanation": "Don't let the need for psychological relief override your trading plan. Cutting winners short while letting losers run is a common path to poor performance.",
    "category": "Psychological Relief"
  },
  {
    "id": 20,
    "scenario": "You notice you tend to make your best trades when you're calm and your worst trades when you're stressed or emotional.",
    "options": [
      "Try to trade more when emotional to overcome the pattern",
      "Develop a pre-trading routine to check your emotional state",
      "Only trade when you feel completely confident"
    ],
    "correct": 1,
    "explanation": "Self-awareness is crucial in trading. Developing routines to assess your emotional state before trading helps prevent emotion-driven mistakes.",
    "category": "Self-Awareness"
  }
]